//
//  Constants.swift
//  MyHabits
//
//  Created by Nikita Byzov on 07.08.2022.
//

import Foundation

enum Constants{
    
    //MARK: - Заголовки
    
    static let infoTitleView = "Информация"
    static let mainScreenTitle = "Сегодня"
    static let createTitle = "Создать"
    static let editTitle = "Править"
    static let alertTitle = "Внимание!"
    static let textBarTitile = "Все получится!"
    static let headerOfDetailTaskTable = "Активность"
    static let alertTitleDelete = "Удалить привычку"
    
    //MARK: - Тексты
    
    static let infoTextStart = "Привычка за 21 день"
    static let infoTextEnd = "Прохождение этапов, за которые за 21 день вырабатывается привычка, подчиняется следующему алгоритму: \n\n1. Провести 1 день без обращения к старым привычкам, стараться вести себя так, как будто цель, загаданная в перспективу, находится на расстоянии шага.\n\n2. Выдержать 2 дня в прежнем состоянии самоконтроля.\n\n3. Отметить в дневнике первую неделю изменений и подвести первые итоги – что оказалось тяжело, что – легче, с чем еще предстоит серьезно бороться.\n\n4. Поздравить себя с прохождением первого серьезного порога в 21 день. За это время отказ от дурных наклонностей уже примет форму осознанного преодоления и человек сможет больше работать в сторону принятия положительных качеств\n\n5. Держать планку 40 дней. Практикующий методику уже чувствует себя освободившимся от прошлого негатива и двигается в нужном направлении с хорошей динамикой. \n\n6. На 90-й день соблюдения техники все лишнее из «прошлой жизни» перестает напоминать о себе, и человек, оглянувшись назад, осознает себя полностью обновившимся.\n\n7. Психологи предостерегают людей, решивших следовать концепции, от самовольно назначенных себе «отпусков» между прохождением этапов. Доказано, что, даже отступив от установленных ограничений всего на 1 день, человек рискует уже не возвратиться к борьбе с плохими привычками и пустить дело на самотек."
    static let alertText = "Не заполнено поле 'Название', сохранение данных невозможно"
    static let alertTextDelete = "Вы хотите удалить привычку "
    
    //MARK: - Данные для полей
    
    static let name = "Название"
    static let placeholder = "Бегать по утрам, спать 8 часов и т.п."
    static let color = "Цвет"
    static let time = "Время"
    static let everyDayIn = "Каждый день в"
    static let agreement = "Понятно"
    static let deleteButton = "Удалить привычку"
    static let alertButtonCansel = "Отмена"
    static let alertButtonDelete = "Удалить"
    static let navBarCansel = "Отменить"
    static let navBarSave = "Сохранить"
}
